Check if the object contains a valid NurbsSurfaceData.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2016
 Syntax
  C#
public bool IsValid()
  Visual Basic
Public Function IsValid As Boolean
  Visual C++
public:
bool IsValid()
 Return Value
 True if it is a valid NurbsSurfaceData, false otherwise.
 See Also
  NurbsSurfaceData Class
  Autodesk.Revit.DB Namespace